import 'package:get/get.dart';

class PaypalController extends GetxController {
  RxList recordLists = [
    {
      "title": "充值",
      'price': 100.00,
      'date': '2025-12-29 12:03:24',
    },
    {"title": "充值", 'price': 100.00, 'date': '2025-12-23 11:13:12'},
    {"title": "充值", 'price': 200.00, 'date': '2025-12-13 10:24:34'},
    {"title": "充值", 'price': 300.00, 'date': '2025-12-01 12:12:23'},
    {"title": "充值", 'price': 100.00, 'date': '2025-11-22 09:34:34'},
    {"title": "充值", 'price': 300.00, 'date': '2025-11-10 07:31:34'},
    {"title": "充值", 'price': 200.00, 'date': '2025-11-03 08:45:45'},
    {"title": "充值", 'price': 100.00, 'date': '2025-10-25 15:56:21'},
    {"title": "充值", 'price': 50.00, 'date': '2025-10-13 17:43:34'},
    {"title": "充值", 'price': 60.00, 'date': '2025-10-05 18:23:45'},
    {"title": "充值", 'price': 70.00, 'date': '2025-09-25 19:34:23'},
    {"title": "充值", 'price': 200.00, 'date': '2025-09-12 20:43:34'},
    {"title": "充值", 'price': 200.00, 'date': '2025-09-05 21:12:45'},
    {"title": "充值", 'price': 80.00, 'date': '2025-08-20 13:32:56'},
    {"title": "充值", 'price': 90.00, 'date': '2025-08-13 14:24:43'},
    {"title": "充值", 'price': 100.00, 'date': '2025-08-05 13:20:23'},
    {"title": "充值", 'price': 100.00, 'date': '2025-07-27 09:21:34'},
    {"title": "充值", 'price': 100.00, 'date': '2025-07-18 08:22:45'},
    {"title": "充值", 'price': 200.00, 'date': '2025-07-09 09:24:56'},
    {"title": "充值", 'price': 100.00, 'date': '2025-07-01 09:25:23'},
    {"title": "充值", 'price': 100.00, 'date': '2025-06-30 10:29:34'},
    {"title": "充值", 'price': 100.00, 'date': '2025-06-15 11:40:43'},
  ].obs;
}
